In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\asus\desktop\data\venv\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\asus\desktop\data\venv\lib\site-packages (from pandas) (2.1.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\asus\desktop\data\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\asus\desktop\data\venv\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\asus\desktop\data\venv\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\asus\desktop\data\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [4]:
import pandas as pd

In [5]:
#series
data =[1,2,3,4,5]
series = pd.Series(data)
print("series\n" , series)
print(type(series))

series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
#creating series from dictonary

data ={'a':1,'b':2,'c':3}
ses =pd.Series(data)
print(ses)

a    1
b    2
c    3
dtype: int64

In [6]:
data =[10,20,30]
ind =['a','b','c']
pd.Series(data, index =ind)

a    10
b    20
c    30
dtype: int64

In [10]:
#dataframe
#create a data frame from dic

data ={'Name':['krish','jhon','jack'],
       'Age':[25,30,45],
       'city':['bangl','new york','floria']}

df = pd.DataFrame(data)
print(df)
print(type(df)
      )

    Name  Age      city
0  krish   25     bangl
1   jhon   30  new york
2   jack   45    floria
<class 'pandas.core.frame.DataFrame'>

In [25]:
##create thee data frame  from list of dictionaries
data =[
    {'Name':'kirsh' , 'age':34,'city':'banglore'},
    {'Name':'ram' , 'age':30,'city':'gwalior'},
    {'Name':'aamna' , 'age':94,'city':'jai'}
      ]
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  age      city
0  kirsh   34  banglore
1    ram   30   gwalior
2  aamna   94       jai
<class 'pandas.core.frame.DataFrame'>

In [26]:
df

    Name  age      city
0  kirsh   34  banglore
1    ram   30   gwalior
2  aamna   94       jai

In [27]:
df['salary'] =[1000,2000,3000]
df

    Name  age      city  salary
0  kirsh   34  banglore    1000
1    ram   30   gwalior    2000
2  aamna   94       jai    3000

In [38]:
df = pd.read_csv('data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [39]:
df.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [7]:
df.head()

NameError: name 'df' is not defined

In [15]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

Date        2023-01-01
Category             A
Value             28.0
Product       Product1
Sales            754.0
Region            East
Name: 0, dtype: object

In [22]:
#accesing spefic element
df.at[4,'Date']
df.iat[4,0]

'2023-01-05'

In [34]:
#data manupliaction with dataframe

df

#adding roww
df['salary'] =[1000,2000,3000]
df

#remove coloum
df.drop('salary',axis=1,inplace= True)

In [35]:
df

    Name  age      city
0  kirsh   34  banglore
1    ram   30   gwalior
2  aamna   94       jai

In [36]:
#adding age to coloum
df['age'] = df ['age']+1
df

    Name  age      city
0  kirsh   35  banglore
1    ram   31   gwalior
2  aamna   95       jai

In [37]:
df.drop(0,inplace=True)
df

    Name  age     city
1    ram   31  gwalior
2  aamna   95      jai